-- --------------------------------------------------------
-- Host:                         
-- Server version:               5.6.11 - MySQL Community Server (GPL)
-- Server OS:                    Win32
-- HeidiSQL version:             7.0.0.4053
-- Date/time:                    2014-01-31 17:52:35
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET FOREIGN_KEY_CHECKS=0 */;

-- Dumping structure for table accessories.module
DROP TABLE IF EXISTS `module`;
CREATE TABLE IF NOT EXISTS `module` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `parent_id` int(10) DEFAULT '0',
  `object_id` int(10) NOT NULL,
  `type_id` int(10) NOT NULL,
  `name` varchar(50) NOT NULL,
  `rights` int(10) NOT NULL,
  `path` varchar(64) DEFAULT NULL,
  `sort` int(10) DEFAULT NULL,
  `can_delete` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=247 DEFAULT CHARSET=utf8;

-- Dumping data for table accessories.module: ~42 rows (approximately)
/*!40000 ALTER TABLE `module` DISABLE KEYS */;
INSERT INTO `module` (`id`, `parent_id`, `object_id`, `type_id`, `name`, `rights`, `path`, `sort`, `can_delete`) VALUES
	(1, 0, 1, 1, 'Модуль по созданию модулей', 0, '0', 0, 0),
	(2, 1, 1, 4, 'Модуль', 0, '1', 0, 0),
	(3, 2, 1, 2, 'Главные свойства модулей', 0, '1,2', 0, 0),
	(31, 3, 1, 3, 'ID', 0, '1,2,3', 10, 0),
	(32, 3, 2, 3, 'Тип создаваемого модуля', 0, '1,2,3', 20, 0),
	(33, 3, 3, 3, 'Название создаваемого модуля', 0, '1,2,3', 30, 0),
	(34, 3, 4, 3, 'Описание создаваемого модуля', 0, '1,2,3', 40, 0),
	(37, 1, 4, 4, 'Тип', 0, '1', NULL, 0),
	(38, 37, 0, 2, 'Главные свойства типов', 0, '1,37', NULL, 0),
	(39, 38, 15, 3, 'ID', 0, '1,37,38', 10, 0),
	(40, 38, 16, 3, 'Тип создаваемого типа', 0, '1,37,38', 20, 0),
	(41, 38, 17, 3, 'Название создаваемого типа', 0, '1,37,38', 30, 0),
	(42, 38, 19, 3, 'Описание создаваемого типа', 0, '1,37,38', 50, 0),
	(43, 38, 18, 3, 'Таблица для типа', 0, '1,37,38', 50, 0),
	(44, 1, 2, 4, 'Вкладка', 0, '1', NULL, 0),
	(45, 44, 0, 2, 'Главные свойства вкладок', 0, '1,44', NULL, 0),
	(46, 45, 20, 3, 'ID', 0, '1,44,45', 10, 0),
	(47, 45, 21, 3, 'Тип создаваемой вкладки', 0, '1,44,45', 20, 0),
	(48, 45, 22, 3, 'Название создаваемой вкладки', 0, '1,44,45', 30, 0),
	(49, 1, 3, 4, 'Параметр', 0, '1', NULL, 0),
	(50, 49, 0, 2, 'Главные свойства параметров', 0, '1,49', NULL, 0),
	(51, 50, 23, 3, 'ID', 0, '1,49,50', 10, 0),
	(52, 50, 24, 3, 'Тип параметра', 0, '1,49,50', 20, 0),
	(53, 50, 25, 3, 'Название параметра', 0, '1,49,50', 30, 0),
	(54, 50, 26, 3, 'Таблица параметра', 0, '1,49,50', 40, 0),
	(55, 50, 27, 3, 'Поле в таблице для параметра', 0, '1,49,50', 50, 0),
	(56, 50, 28, 3, 'Тип визуального элемента', 0, '1,49,50', 60, 0),
	(57, 50, 29, 3, 'Регулярка для валидации', 0, '1,49,50', 70, 0),
	(58, 50, 30, 3, 'Описание параметра', 0, '1,49,50', 90, 0),
	(60, 50, 31, 3, 'Видимость параметра', 0, '1,49,50', 80, 0),
	(219, 50, 36, 3, 'Родительский раздел', 0, '1,49,50', 15, 0),
	(231, 3, 48, 3, 'Можно ли удалить', 0, '1,2,3', 50, 0),
	(232, 50, 49, 3, 'Сортировка', 0, '1,49,50', 100, 0),
	(233, 50, 50, 3, 'Можно ли удалить', 0, '1,49,50', 110, 0),
	(239, 50, 51, 3, 'Описание ошибки валидации', 0, '1,49,50', 75, 0),
	(240, 0, 2, 1, 'Товары', 0, '0', NULL, 0),
	(241, 240, 5, 4, 'Раздел', 0, '240', NULL, 1),
	(242, 240, 6, 4, 'Аксессуар', 0, '240', NULL, 1),
	(243, 241, 0, 2, 'Свойства раздела', 0, '240,241', NULL, 1),
	(244, 243, 52, 3, 'ID', 0, '240,241,243', 10, 0),
	(245, 243, 53, 3, 'Тип раздела', 0, '240,241,243', 20, 0),
	(246, 243, 54, 3, 'Название раздела', 0, '240,241,243', 30, 0);
/*!40000 ALTER TABLE `module` ENABLE KEYS */;
/*!40014 SET FOREIGN_KEY_CHECKS=1 */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
